#트레이너를 위한 테이블입니다.
#테스트를 위해 10여개의 트레이너 정보를 등록했습니다.

CREATE TABLE trainer (
  id varchar(20) NOT NULL,
  pay int(11) NOT NULL,
  career char(200) NOT NULL,
  latitude float NOT NULL,
  longtitude float NOT NULL,
  curriculum varchar(1000) NOT NULL,
  date timestamp NOT NULL,
  time char(200) NOT NULL,
  exp int(11) NOT NULL,
  field1 char(50) NOT NULL,
  field2 char(50) NOT NULL,
  field3 char(50) NOT NULL,
  address1 varchar(100) NOT NULL,
  address2 varchar(100) NOT NULL,
  PRIMARY KEY(id),
  FOREIGN KEY(id) REFERENCES user(id) 
  ON DELETE CASCADE 
  ON UPDATE CASCADE
)

INSERT INTO trainer VALUES 
('trainer1',12,'은상',37.3052,127.909,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',3,'대회준비','재활교정','린매스업','강원도 원주시 흥업면 한라대길 12-32','3층'),
('trainer10',11,'동상',37.3443,127.935,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',3,'선수준비','프로필사진','체형교정','강원도 원주시 서원대로 205','단계주공아파트 102동 301호'),
('trainer11',10,'동상',37.4933,127.03,'1주차 :2주차 :','2019-11-24 13:57:28.000000','8시~20시',5,'린매스업','체중감량','다이어트','서울 강남구 강남대로 238 스카이쏠라빌딩','3층'),
('trainer12',10,'동상',35.3784,126.709,'1주차 :','2019-12-02 10:38:54.000000','7시 17시',5,'린매스업','약점보완','린매스업','전북 고창군 고수면 가협길 21 ','1'),
('trainer2',13,'동상',37.3052,127.909,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',10,'선수준비','프로필사진','다이어트','강원도 원주시 흥업면 한라대길 12-32','3층'),
('trainer3',14,'동상',37.3052,127.909,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',2,'다이어트','대회준비','프로필사진','강원도 원주시 흥업면 한라대길 12-32','3층'),
('trainer4',13,'참가상',37.302,127.923,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',3,'재활교정','대회준비','린매스업','강원 원주시 흥업면 울업1길 33 흥업 경동아파트','3층'),
('trainer5',9,'참가상',37.3019,127.924,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',6,'선수준비','다이어트','린매스업','강원도 원주시 흥업면 울업1길 33','101동 301호'),
('trainer6',13,'금상',37.3019,127.924,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',7,'멸치탈출','재활교정','다이어트','강원도 원주시 흥업면 울업1길 33','101동 301호'),
('trainer7',12,'동상',37.3019,127.924,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',3,'체형교정','대회준비','선수준비','강원도 원주시 흥업면 울업1길 33','101동 301호'),
('trainer8',13,'참가상',37.3019,127.924,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',10,'체형교정','다이어트','선수준비','강원도 원주시 흥업면 울업1길 33','101동 301호'),
('trainer9',13,'금상',37.3443,127.935,'1주차 : ','2019-11-24 13:05:51.000000','10시 ~ 20시',7,'선수준비','대회준비','다이어트','강원도 원주시 서원대로 205','단계주공아파트 102동 301호');
